[Killed] Equality mutation
mutation-tests/mutation-tests/Calculator/VatCalculator.cs:7:17
     {
         public static double CalculateFinalPrice(double productPrice)
         {
-            if (productPrice < 200)
+            if (productPrice > 200)
             {
                 return productPrice + (productPrice * 0.23);
killedBy: medium_mutation_tests.VatCalculatorTests.VatCalculator_ProductMoreThan200_VatFree; medium_mutation_tests.VatCalculatorTests.VatCalculator_ProductLessThan200_VatFree

[Killed] Negate expression
mutation-tests/mutation-tests/Calculator/VatCalculator.cs:7:17
     {
         public static double CalculateFinalPrice(double productPrice)
         {
-            if (productPrice < 200)
+            if (!(productPrice < 200))
             {
                 return productPrice + (productPrice * 0.23);
killedBy: medium_mutation_tests.VatCalculatorTests.VatCalculator_ProductMoreThan200_VatFree; medium_mutation_tests.VatCalculatorTests.VatCalculator_ProductLessThan200_VatFree

[Killed] Arithmetic mutation
mutation-tests/mutation-tests/Calculator/VatCalculator.cs:9:24
         {
             if (productPrice < 200)
             {
-                return productPrice + (productPrice * 0.23);
+                return productPrice - (productPrice * 0.23);
             }
 
killedBy: medium_mutation_tests.VatCalculatorTests.VatCalculator_ProductLessThan200_VatFree

[Killed] Arithmetic mutation
mutation-tests/mutation-tests/Calculator/VatCalculator.cs:9:40
         {
             if (productPrice < 200)
             {
-                return productPrice + (productPrice * 0.23);
+                return productPrice + (productPrice / 0.23);
             }
 
killedBy: medium_mutation_tests.VatCalculatorTests.VatCalculator_ProductLessThan200_VatFree
